ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/ExchangePlans/СинхронизацияДанныхЧерезУниверсальныйФормат/СинхронизацияДанныхЧерезУниверсальныйФормат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="886887cd-8fd0-4bec-899c-100aab33747d" thisNode="781d6d49-b319-4fb7-865a-faa5232d2daa">
  <name>СинхронизацияДанныхЧерезУниверсальныйФормат</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>vs_ИспользоватьОтборПоСтатьямРасходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_ИспользоватьОтборПоВидамНоменклатурыДляСборкиТоваров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>vs_СтатьиРасходов</name>
    <attributes>
      <name>vs_СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>vs_ВидыНоменклатуры</name>
    <attributes>
      <name>vs_ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/ExchangePlans/СинхронизацияДанныхЧерезУниверсальныйФормат/Forms/ФормаСинхронизации/Module.bsl
&НаКлиенте
Процедура vs_ОткрытьСписокВыбранныхСтатьейРасходов(Команда)
	ПараметрыПодбора = Новый Структура();
	ПараметрыПодбора.Вставить("ДляВыбора", Истина);
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("vs_ОткрытьСписокВыбранныхСтатьейРасходовОбработка", ЭтотОбъект, ЭтотОбъект);
	
	ОткрытьФорму("ПланВидовХарактеристик.СтатьиРасходов.ФормаВыбора", ПараметрыПодбора,,,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура vs_ОткрытьСписокВыбранныхСтатьейРасходовОбработка(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("vs_СтатьяРасходов", Результат);
	ИскомыеСтроки = Объект.vs_СтатьиРасходов.НайтиСтроки(ПараметрыОтбора);
	Если ИскомыеСтроки.ВГраница() = -1 Тогда
		СтрТЧ = Объект.vs_СтатьиРасходов.Добавить();	
		СтрТЧ.vs_СтатьяРасходов = Результат;
		Модифицированность = Истина;
	КонецЕсли;
	ОбновитьНаименованиеКомандФормы();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаСервере
&После("ОбновитьНаименованиеКомандФормы")
Процедура vs_ОбновитьНаименованиеКомандФормы()
	// Обновим заголовок выбранных статей
	Если Объект.vs_СтатьиРасходов.Количество() > 0 Тогда
		
		Выбранныеvs_СтатьиРасходов = Объект.vs_СтатьиРасходов.Выгрузить().ВыгрузитьКолонку("vs_СтатьяРасходов");
		НовыйЗаголовокvs_СтатьиРасходов = СтрСоединить(Выбранныеvs_СтатьиРасходов, ",");
		
	Иначе
		
		НовыйЗаголовокvs_СтатьиРасходов = НСтр("ru = 'Открыть список статьей расходов'");
		
	КонецЕсли;
	
	Элементы.vs_ОткрытьСписокВыбранныхСтатьейРасходов.Заголовок = НовыйЗаголовокvs_СтатьиРасходов; 
	
	// Обновим заголовок выбранных Видов Номенклатуры
	Если Объект.vs_ВидыНоменклатуры.Количество() > 0 Тогда
		
		Выбранныеvs_ВидыНоменклатуры = Объект.vs_ВидыНоменклатуры.Выгрузить().ВыгрузитьКолонку("vs_ВидНоменклатуры");
		НовыйЗаголовокvs_ВидНоменклатуры = СтрСоединить(Выбранныеvs_ВидыНоменклатуры, ",");
		
	Иначе
		
		НовыйЗаголовокvs_ВидНоменклатуры = НСтр("ru = 'Открыть список видов номенклатуры'");
		
	КонецЕсли;
	
	Элементы.vs_ОткрытьСписокВыбранныхВидовНоменклатуры.Заголовок = НовыйЗаголовокvs_ВидНоменклатуры;

КонецПроцедуры

&НаКлиенте
&После("УстановитьУсловияОграниченияСинхронизации")
Процедура vs_УстановитьУсловияОграниченияСинхронизации()
	Если ЭтотОбъект.vs_РежимВыгрузкиСтатьейРасходов = 1 Тогда
		Объект.vs_ИспользоватьОтборПоСтатьямРасходов = Истина;
	Иначе
		Объект.vs_ИспользоватьОтборПоСтатьямРасходов = Ложь;
		Объект.vs_СтатьиРасходов.Очистить();
	КонецЕсли; 
	Если ЭтотОбъект.vs_РежимВыгрузкиПоВидамНоменклатуры = 1 Тогда
		Объект.vs_ИспользоватьОтборПоВидамНоменклатурыДляСборкиТоваров = Истина;
	Иначе
		Объект.vs_ИспользоватьОтборПоВидамНоменклатурыДляСборкиТоваров = Ложь;
		Объект.vs_ВидыНоменклатуры.Очистить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура vs_ПереключательРежимаВыгрузкиПоСтатьямРасходовБезОтбораПриИзменении(Элемент)
	УстановитьУсловияОграниченияСинхронизации();
	УстановитьВидимостьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура vs_ПереключательРежимаВыгрузкиПоСтатьямРасходовСОтборомПриИзменении(Элемент)
	УстановитьУсловияОграниченияСинхронизации();
	УстановитьВидимостьНаСервере();
КонецПроцедуры

&НаСервере
&Перед("УстановитьВидимостьНаСервере")
Процедура vs_УстановитьВидимостьНаСервере()
	Если Элементы.vs_ГруппаСтраницыОтборПоСтатьямРасходов.Видимость Тогда
		Элементы.vs_ГруппаСтраницыОтборПоСтатьямРасходов.Доступность = Объект.ПравилаОтправкиДокументов <> "НеСинхронизировать";
		Элементы.vs_ОткрытьСписокВыбранныхСтатьейРасходов.Доступность = ЭтотОбъект.vs_РежимВыгрузкиСтатьейРасходов = 1;
	КонецЕсли;
	Если Элементы.vs_ГруппаСтраницыОтборПоВидамНоменклатуры.Видимость Тогда
		Элементы.vs_ГруппаСтраницыОтборПоВидамНоменклатуры.Доступность = Объект.ПравилаОтправкиДокументов <> "НеСинхронизировать";
		Элементы.vs_ОткрытьСписокВыбранныхВидовНоменклатуры.Доступность = ЭтотОбъект.vs_РежимВыгрузкиПоВидамНоменклатуры = 1;   // fix Designer 2025.12.09
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура vs_ОткрытьСписокВыбранныхВидовНоменклатуры(Команда)
	ПараметрыПодбора = Новый Структура();
	ПараметрыПодбора.Вставить("ДляВыбора", Истина);
	//ПараметрыПодбора = Новый Структура;
	//ПараметрыПодбора.Вставить("РежимВыбора", Истина);
	//ПараметрыПодбора.Вставить("ЗакрыватьПриВыборе", Ложь);
	//ПараметрыПодбора.Вставить("МножественныйВыбор", Истина);
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("vs_ОткрытьСписокВыбранныхВидовНоменклатурыОбработка", ЭтотОбъект, ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ВидыНоменклатуры.ФормаВыбора", ПараметрыПодбора,,,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура vs_ОткрытьСписокВыбранныхВидовНоменклатурыОбработка(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("vs_ВидНоменклатуры", Результат);
	ИскомыеСтроки = Объект.vs_ВидыНоменклатуры.НайтиСтроки(ПараметрыОтбора);
	Если ИскомыеСтроки.ВГраница() = -1 Тогда
		СтрТЧ = Объект.vs_ВидыНоменклатуры.Добавить();	
		СтрТЧ.vs_ВидНоменклатуры = Результат;
		Модифицированность = Истина;
	КонецЕсли;
	ОбновитьНаименованиеКомандФормы();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаКлиенте
Процедура vs_ПереключательРежимаВыгрузкиПоВидамНоменклатурыБезОтбораПриИзменении(Элемент)
	УстановитьУсловияОграниченияСинхронизации();
	УстановитьВидимостьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура vs_ПереключательРежимаВыгрузкиПоВидамНоменклатурыСОтборомПриИзменении(Элемент)
	УстановитьУсловияОграниченияСинхронизации();
	УстановитьВидимостьНаСервере();
КонецПроцедуры
